digkill/ESP32-S3-MIKO-MEDIARISE/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

# Console on native USB (/dev/tty.usbmodem*): one port for logs and stdin (AMOLED HELP/SERVO
# via fgetc(stdin)). With UART primary + USB-JTAG secondary, monitor on usbmodem shows logs
# but keyboard input stays on UART — commands look \"dead\".
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_BOARD_TYPE_WAVESHARE_S3_TOUCH_AMOLED_2_06=y
CONFIG_USE_DEVICE_AEC=y

CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# Keep app/assets below the 16 MB cache-mapping boundary on ESP32-S3.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/v2/16m.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions/v2/16m.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Push 256..511 B allocations to PSRAM to relieve internal-RAM fragmentation
# (LVGL widgets/cJSON/std::string use plain malloc via LV_USE_CLIB_MALLOC).
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_SPIRAM_MEMTEST=n
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=3
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y

CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# CONFIG_SR_WN_WN9_NIHAOXIAOZHI_TTS=y
# Используем английскую модель для тестирования
# Доступные варианты: HIESP, ALEXA, JARVIS_TTS, COMPUTER_TTS, HEYWILLOW_TTS, HIMFIVE
CONFIG_SR_WN_WN9_HIESP=y

CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# LVGL Graphics
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_USE_IMGFONT=y

# SPI Configuration for Display
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# GDMA Configuration for SPI DMA transfers
CONFIG_GDMA_CTRL_FUNC_IN_IRAM=y
CONFIG_GDMA_ISR_HANDLER_IN_IRAM=y
CONFIG_GDMA_OBJ_DRAM_SAFE=y

# Default Language - Russian
CONFIG_LANGUAGE_RU_RU=y

# Do not start Xiaozhi-* Wi-Fi setup hotspot; retry station only
CONFIG_SKIP_WIFI_SOFTAP_PROVISIONING=y

# HomeBot iOS control channel (BLE GATT with bonding for Wi-Fi credentials)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
# Robot is peripheral + GATT server only; drop unused central/scan/client roles.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_GATT_CLIENT=n
